package 변수및자료형;

import java.util.Scanner;

public class Ex02변수명 {

	public static void main(String[] args) {
		
		// 변수명 작성 규칙!
		// 1. 키워드 사용 불가능
		// ---> eclipse 작성 시 색깔이 변한다면 키워드!
		// 2. 대소문자를 구분하고 길이에 제한이 없다.
		// ---> 변수명은 의미전달이 중요하다!! a,b,c,d 이렇게 짓지 말기!
		// 3. 숫자로 시작할 수 없다.
		// ---> 숫자는 값으로 인식한다.
		// 4. 특수문자는 _와 $만 가능하다.
		
		// 자바 개발자에게 권장되는 규칙들
		// 1. 변수 시작은 소문자로!
		// 2. 여러글자로 이어지는 경우에는 이어지는 단어의 첫글자를 대문자로!
		// -----> 카멜식 기법(Camel) (낙타의 혹 같다)
		// ex) int inputNumber = 6;
		
		
	    
		
		
		
		
		

	}

}
